<template>
  <section class="js-page page home">
    <section class="js-program program">
      <div class="columns">
        <div class="js-item intro" data-index="00">
          <h2 class="section-title">Нужен наставник?</h2>
          <div class="description">
            <p>Привет! Ты ещё ищешь наставника? У нас небольшая команда, которая занимается менторством <strong>с упором на веб</strong>.</p>
            <p>Сейчас разрабатываем авторский курс, в ходе которого у тебя будет возможность достаточно активно развиваться. В нём разбираются как самые основы, так и достаточно углублённые темы. Углубленно затронем как фронтенд, так и бэкенд. Будем писать на популярных фреймворках, разберём их внутренности. Пройдём важные и интересные темы <strong>computer science</strong>. Поработаем с используемыми базами данных, захватим паттерны проектирования и архитектурные решения.</p>
            <p>Готовы оказать практически беспрерывную связь: ответы на вопросы и всяческую поддержку. Всё это <strong>абсолютно бесплатно</strong>, мы не хантим никого на какие-либо проекты. Если есть какие-то вопросы — задавай.</p>
          </div>
          <div class="buttons">
            <a href="https://t.me/tg09F9" target="_blank">
              <img :src="require('@/assets/images/icons/tg.svg')" alt="tg">
              <span>Беседа в Telegram</span>
            </a>
            <a href="https://t.me/tg09F9" target="_blank">
              <img :src="require('@/assets/images/icons/tg.svg')" alt="tg">
              <span>Написать кураторам</span>
            </a>
          </div>
        </div>
        <Item :i="i" :item="item" v-for="(item, i) in items" :key="i" />
      </div>
    </section>
  </section>
</template>

<script>
import Masonry from 'masonry-layout'
import Item from '@/components/Item'

export default {
  name: 'Program',
  components: { Item },
  data() {
    return {
      items: [{
        title: 'Основы',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 313, height: 406 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Computer Science',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 415, height: 447 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Продвинутый JS, HTML, CSS',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 347, height: 444 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Vue, React и Node.js',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 409, height: 384 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Базы данных и архитектура',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 409, height: 384 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'DevOps',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 227, height: 227 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
        ],
      }, {
        title: 'GitHub, GitFlow',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 200, height: 200 },
        elements: [
          { text: 'GitHub', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'GitFlow', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Branches', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Github Actions', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
        ],
      }, {
        title: 'SSR и Electron',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 200, height: 200 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Паттерны проектирования',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 160, height: 160 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }, {
        title: 'Практические проекты',
        text_1: 'В ходе прохождения курса мы реализуем ряд интересных проектов для подкрепления знаний и поддержания вашего интереса.',
        text_2: 'Мы постарались придумать самые вариативные проекты, чтобы разработка никому не наскучила.',
        size: { width: 200, height: 200 },
        elements: [
          { text: 'Приложение для музыки', duration: '18mn', tooltip: 'Мы создадим небольшое музыкальное приложение, через которое вы сможете добавлять, удалять и слушать музыкальные произведения. Мы реализуем полноценный плеер, а также компактный список плейлистов. Вместе с этим мы сэмулируем хранение музыки, а базируясь на этом будем также выводить общий каталог, из которого аудиозаписи можно будет переместить в ваши плейлисты.' },
          { text: 'Видеоплеер', duration: '23mn', tooltip: 'Мы создадим полноценный видеоплеер, который вы сможете использовать для просмотра видеороликов. Вы сможете листать видео, менять качество и даже включать подготовленные субтитры.' },
          { text: 'Клон Paint', duration: '36mn', tooltip: 'Реализуем приложение для рисования, которое будет подозрительно сильно похоже на Paint. Введем туда известные функции таких редакторов, чем закрепим прочитанный материал о Canvas.' },
          { text: 'Приложение Банк', duration: '35mn', tooltip: 'Современный человек прекрасно знает, что такое банковское приложение и как оно работает. Напишем свою минималистичную копию, в пределах которой мы сможем выпускать карты, пополнять их счёт, переводить средства на другие карты и снимать деньги (ремарка: ненастоящие!). Также реализуем несколько «магазинов», которые будут продавать нам товары. Внедрим систему отчётов и возвращения денег за покупки.' },
          { text: 'Угадай число (улучшено)', duration: '46mn', tooltip: 'Привычная для нас игра, где ведущий загадывает число от 0 до N, а наша задача угадать его за наименьшее количество попыток. Но это было бы слишком просто, поэтому мы также реализуем голосовой ввод для данной игры, для чего нам потребуется научиться распознавать речь. А вместе с этим немного оживим нашего ведущего и основываясь на ранее изученных алгоритмах позволим нашему боту стать непобедимым — он будет последовательно играть по тактике деления пополам.' },
          { text: 'Крестики-нолики (улучшено)', duration: '30mn', tooltip: 'Реализуем столь популярную игру с добавлением небольшой детали — нашим противником станет не такой уж и глупый бот, который будет выбирать оптимальные ходы с помощью ранее пройденного нами правила принятия решений — Minimax.' },
          { text: 'PWA', duration: '57mn', tooltip: 'Напишем Progressive Web Application, где постараемся поддерживать все основные функциональные возможности, которые сейчас поддерживают такие приложения. Разберём, для чего они нужны и как их следует проектировать.' },
          { text: 'Клавагонки', duration: '30mn', tooltip: 'Создадим приложение, в котором сможем потренировать скорость печатания на разных раскладках и для текста разной сложности.' },
          { text: 'Тренировка реакции', duration: '35mn', tooltip: 'Реализуем приложение для тренировки реакции, которое будет работать по принципу жизненного цикла маркеров, реагируя на которые мы сможем проанализировать насколько вы были быстры. Сделаем так, чтобы маркеры можно было настраивать: от их цвета и формы до способа появления и выделяемого времени на реакцию.' },
          { text: 'Калькулятор (две версии)', duration: '38mn', tooltip: 'Напишем свободный калькулятор, в который можно будет задать математическое выражение. Калькулятор будет принимать на вход строку типа (5 + 2) * 9, и следом будет возвращать результат. Мы реализуем две версии такого калькулятора: первая реализация будет базироваться на лексическом анализе и генерации AST, который после мы будем рекурсивно проходить; вторую версию же мы реализуем с помощью обратной польской нотации.' },
          { text: 'Текстовый редактор', duration: '1h 14mn', tooltip: 'Создадим свой собственный текстовый редактор, а также введем сохранение написанного в качестве файла под нашим особым форматом. Наш редактор сможет принимать этот формат и парсить, из-за чего мы сможем просматривать и редактировать сохранённые файлы.' },
        ],
      }]
    }
  },
  mounted() {
    new Masonry('.columns', {
      itemSelector: '.js-item',
      columnWidth: 640,
      fitWidth: true,
      resize: false
    })
  },
}

// { width: 350, height: 321 },
// { width: 227, height: 227 },
// { width: 200, height: 200 },
</script>

<style lang="sass">
@import '@/assets/sass/style.sass'
</style>